{
    "title": "Pitfalls of the img element for serving responsive images",
    "description": "Why you might want to use the picture element for responsive images instead of the img element.",
    "date": "2016-05-12",
    "body": "<p>At the Guardian we wanted to serve responsive images based solely on their rendered width in the page layout at each breakpoint. We explicitly decided not to respond to DPR, preferring to save on user bandwidth over increased image quality. Our first version of this used the <code>img</code> element in combination with the <code>sizes</code> and <code>srcset</code>, but we soon noticed holes in our implementation, which led to high DPR devices unintentionally incurring larger image downloads. In this post I will explain <a href=\"https://github.com/guardian/frontend/pull/12691\">how we used the picture element to workaround this</a>, and how—once we decided to serve retina images—this enabled us to optimise for them separately.</p>\n<p>For each size we provide a corresponding source image with a matching width. For example, at viewport widths greater or equal to 600px, the image appears at 600px wide in our layout. At all smaller viewport widths, the image appears at 300px wide in our layout. The code for this looks like so:</p>\n<pre><code>&lt;img sizes=&quot;(min-width: 600px) 600px, 300px&quot;\n     srcset=&quot;600.jpg 600w, 300.jpg 300w&quot; /&gt;\n</code></pre>\n<p>This works fine for “low DPR” devices, but we noticed that high DPR devices could greedily download a larger image. For example, on a device with a pixel ratio of 2 and a viewport width of 300px, the browser would select the correct size (<code>300px</code>) but the incorrect source (<code>600.jpg 600px</code>).</p>\n<p>This was unintentional: our usage of sizes and srcset was strictly for serving images based on breakpoint width, not DPR!</p>\n<p>We had forgotten that the browser’s formula for selecting the <code>img</code>’s source accounted for the device’s DPR. Doh!</p>\n<p>Let’s remind ourselves how the browser selects a source:</p>\n<dl>\n<dt>selected size</dt>\n<dd>first size with a media condition that evaluates true</dd>\n<dt>ideal width</dt>\n<dd>dpr * selected size</dd>\n<dt>selected source</dt>\n<dd>a source in <code>srcset</code> with a width descriptor closest to the ideal width</dd>\n</dl>\n<p>(This formula is not standardised, but it is seemingly consistent across the web platform.)</p>\n<p>So how can we serve images that vary their width by breakpoint and <em>not DPR</em>?</p>\n<p>The answer was the <code>picture</code> element, which allows you to provide multiple <code>source</code> elements, each with their own <code>sizes</code> and <code>srcset</code> attributes. Significantly, the <code>source</code> element also has a <code>media</code> attribute which allows you to guard the element from usage with a media condition. Using the <code>source</code> element we were able to split our <code>sizes</code> and <code>srcset</code> attributes by breakpoint. This meant high DPR devices could only choose from images available at the current breakpoint.</p>\n<pre><code>&lt;picture&gt;\n  &lt;source media=&quot;(min-width: 600px)&quot;\n          sizes=&quot;600px&quot;\n          srcset=&quot;600.jpg 600w&quot; /&gt;\n  &lt;source sizes=&quot;300px&quot;\n          srcset=&quot;300.jpg 300w&quot; /&gt;\n  &lt;img /&gt;\n&lt;/picture&gt;\n</code></pre>\n<p>(In many cases, content authors vary their image widths based on intervals instead of breakpoints, in which case it is safe to use a single <code>img</code> element with <code>sizes</code>/<code>srcset</code> attributes.)</p>\n<p>This structure also gives us increased flexibility. For example, if we did decide to start serving retina images to compatible devices (<a href=\"https://github.com/guardian/frontend/pull/12079\">which we did</a>), we could serve an additional <code>source</code> and match only high DPR devices. This has the added benefit of allowing us to <a href=\"https://blog.imgix.com/2016/03/30/dpr-quality.html\">optimise separately for images we know will only be used on high DPR devices</a>.</p>"
}
