{
    "title": "Page jumping caused by images",
    "date": "2016-06-12",
    "body": "<p>I think page jumping is one of the worst UX/performance problems on the web. One culprit of this is images with undefined <code>width</code> and <code>height</code> attributes—the browser doesn’t know how to lay them out until they have been downloaded, thus the page jumps. The simple fix is to reserve space for them in the page, but more often than not, this is not implemented. Try scrolling down your Twitter timeline on <a href=\"https://twitter.com\">twitter.com</a> with a poor connection—as images load above your reading position, the page will jump, and you’ll have to try and find where you were reading again. This is incredibly frustrating for the user.</p><p>Before responsive web design was a thing, reserving space was as easy as adding <code>height</code> and <code>width</code> attributes to your <code>img</code>. Responsive websites rarely use fixed image sizes, so instead we want to reserve a space with a given aspect ratio. This can be done using the infamous <a href=\"http://daverupert.com/2012/04/uncle-daves-ol-padded-box/\">“<code>padding-bottom</code> hack”</a>. For example, for an image with an aspect ratio of <code>4:3</code>, we can reserve space for the image whilst it loads by wrapping the image with an element whose <code>padding-bottom</code> is set to 75% (<code>width/height</code>), and then absolutely positioning the <code>img</code> relative to this wrapper:</p><pre><code>&lt;div style=&quot;padding-bottom: 75%; position: relative;&quot;&gt;\n    &lt;img style=&quot;position: absolute; width: 100%;&quot; src=&quot;foo.jpg&quot; /&gt;\n&lt;/div&gt;</code></pre><p>Looking at this, it’s no wonder authors rarely bother to reserve space for images.</p><p>When rebuilding my photography blog, <a href=\"https://samefourchords.com\">samefourchords.com</a>, I wanted to use the <code>picture</code> element for art direction, mainly to provide different crops to landscape and portrait devices to increase their impact. I couldn’t do this because, to my knowledge, there’s no way to reserve space for art directed images. The “<code>padding-bottom</code> hack” won’t suffice for this use case, because there is only one <code>img</code> inside the <code>picture</code>, but multiple <code>source</code>s.</p><p>How could the web platform make this easier for content authors? If we could solve that problem, perhaps page jumping on the web will decrease.</p><p>One idea I had was to add an <code>aspectratio</code> attribute to the <code>img</code> element (e.g. <code>aspectratio=&quot;4:3&quot;</code>). Perhaps the <code>source</code> element could also receive an <code>aspectratio</code> attribute, so browsers know how to lay out the <code>img</code> element.</p>"
}
